#include"ui.h"
#include"logic.h"

/*********************************************
功能:boss登录成功后操作选项主界面
使用:在boss的增删改查中调用
传入参数:姓名
**********************************************/
int  BOSSMainUI(char name[30])
{
    int iChoice = 0;
    char ch;
    system("clear");     
    /*
    printf("\n\t****************************************************************\n");
    printf("\t*                                                              *\n");
    printf("\t          ——————欢迎%s进入公司信息管理系统——————                  \n",name);
    printf("\t*                                                              *\n");
    printf("\t****************************************************************\n");
    printf("\t                                                                \n");
    printf("\t                       相关操作选项                           \n");
    printf("\t                                                                \n");
    printf("\t****************************************************************\n");
    printf("\t*                     0.安全退出系统                           *\n");
    printf("\t*                     1.添加人员信息                           *\n");
    printf("\t*                     2.删除人员信息                           *\n");
    printf("\t*                     3.修改人员信息                           *\n");
    printf("\t*                     4.查找人员信息                           *\n");
    printf("\t*                     5.显示人员信息                           *\n");
    printf("\t*                     6.员工工资导入                           *\n");
    printf("\t*                     7.查看工资报表                           *\n");
    printf("\t*                     8.删除了的人员                           *\n");
    printf("\t****************************************************************\n");
*/
	printf("\n\t\033[47;34m****************************************************************\033[0m\n");
    printf("\t\033[47;34m*                                                              *\033[0m\n");
    printf("\t\033[47;34m          ——————欢迎%s进入公司信息管理系统——————              \033[0m\n",name);
    printf("\t\033[47;34m*                                                              *\033[0m\n");
    printf("\t\033[47;34m****************************************************************\033[0m\n");
    printf("\t\033[47;34m                                                                \033[0m\n");
    printf("\t\033[47;34m                       相关操作选项                             \033[0m\n");
    printf("\t\033[47;34m                                                                \033[0m\n");
    printf("\t\033[47;34m****************************************************************\033[0m\n");
    printf("\t\033[47;34m*                     0.安全退出系统                           *\033[0m\n");
    printf("\t\033[47;34m*                     1.添加人员信息                           *\033[0m\n");
    printf("\t\033[47;34m*                     2.删除人员信息                           *\033[0m\n");
    printf("\t\033[47;34m*                     3.修改人员信息                           *\033[0m\n");
    printf("\t\033[47;34m*                     4.查找人员信息                           *\033[0m\n");
    printf("\t\033[47;34m*                     5.显示人员信息                           *\033[0m\n");
    printf("\t\033[47;34m*                     6.员工工资导入                           *\033[0m\n");
    printf("\t\033[47;34m*                     7.查看工资报表                           *\033[0m\n");
    printf("\t\033[47;34m*                     8.删除了的人员                           *\033[0m\n");
    printf("\t\033[47;34m****************************************************************\033[0m\n");
    printf("请输入功能编号0~8:");
    iChoice=inputdigit08(ch);printf("iChoice=%d\n",iChoice);
    return iChoice;
}


//Manager主界面,在manageraction函数中调用
int  ManagerUI(char name[30])
{
    int iChoice = 0;
    char ch;
    system("clear");  
    /*   
    printf("\n\t****************************************************************\n");
    printf("\t*                                                              *\n");
    printf("\t          ——————欢迎%s进入公司信息管理系统——————                  \n",name);
    printf("\t*                                                              *\n");
    printf("\t****************************************************************\n");
    printf("\t                                                                \n");
    printf("\t                       相关操作选项                           \n");
    printf("\t                                                                \n");
    printf("\t****************************************************************\n");
    printf("\t*                     0.安全退出系统                           *\n");
    printf("\t*                     1.添加人员信息                           *\n");
    printf("\t*                     2.删除人员信息                           *\n");
    printf("\t*                     3.修改人员信息                           *\n");
    printf("\t*                     4.查找人员信息                           *\n");
    printf("\t*                     5.显示人员信息                           *\n");
    printf("\t*                     6.删除了的人员                           *\n");
    printf("\t****************************************************************\n");
*/
	printf("\n\t\033[47;31m****************************************************************\033[0m\n");
    printf("\t\033[47;31m*                                                              *\033[0m\n");
    printf("\t\033[47;31m          ——————欢迎%s进入公司信息管理系统——————              \033[0m\n",name);
    printf("\t\033[47;31m*                                                              *\033[0m\n");
    printf("\t\033[47;31m****************************************************************\033[0m\n");
    printf("\t\033[47;31m                                                                \033[0m\n");
    printf("\t\033[47;31m                       相关操作选项                             \033[0m\n");
    printf("\t\033[47;31m                                                                \033[0m\n");
    printf("\t\033[47;31m****************************************************************\033[0m\n");
    printf("\t\033[47;31m*                     0.安全退出系统                           *\033[0m\n");
    printf("\t\033[47;31m*                     1.添加人员信息                           *\033[0m\n");
    printf("\t\033[47;31m*                     2.删除人员信息                           *\033[0m\n");
    printf("\t\033[47;31m*                     3.修改人员信息                           *\033[0m\n");
    printf("\t\033[47;31m*                     4.查找人员信息                           *\033[0m\n");
    printf("\t\033[47;31m*                     5.显示人员信息                           *\033[0m\n");
    printf("\t\033[47;31m*                     6.删除了的人员                           *\033[0m\n");
    printf("\t\033[47;31m****************************************************************\033[0m\n");
    printf("请输入功能编号0~6:");
	iChoice=inputdigit06(ch);
    return iChoice;
}

//主界面
int  SalesmanagerUI(char name[30])
{
    int iChoice = 0;
    char ch;
    system("clear");     
    printf("\n\t\033[47;36m****************************************************************\033[0m\n");
    printf("\t\033[47;36m*                                                              *\033[0m\n");
    printf("\t\033[47;36m          ——————欢迎%s进入公司信息管理系统——————              \033[0m\n",name);
    printf("\t\033[47;36m*                                                              *\033[0m\n");
    printf("\t\033[47;36m****************************************************************\033[0m\n");
    printf("\t\033[47;36m                                                                \033[0m\n");
    printf("\t\033[47;36m                       相关操作选项                             \033[0m\n");
    printf("\t\033[47;36m                                                                \033[0m\n");
    printf("\t\033[47;36m****************************************************************\033[0m\n");
    printf("\t\033[47;36m*                     0.安全退出系统                           *\033[0m\n");
    printf("\t\033[47;36m*                     1.添加人员信息                           *\033[0m\n");
    printf("\t\033[47;36m*                     2.删除人员信息                           *\033[0m\n");
    printf("\t\033[47;36m*                     3.修改人员信息                           *\033[0m\n");
    printf("\t\033[47;36m*                     4.查找人员信息                           *\033[0m\n");
    printf("\t\033[47;36m*                     5.显示人员信息                           *\033[0m\n");
    printf("\t\033[47;36m*                     6.删除了的人员                           *\033[0m\n");
    printf("\t\033[47;36m****************************************************************\033[0m\n");
    printf("请输入功能编号0~6:");
	iChoice=inputdigit06(ch);
    return iChoice;
}

//主界面
int  skillpersonUI(char name[30])
{
    int iChoice = 0;
    system("clear"); 
    char ch;    
    printf("\n\t****************************************************************\n");
    printf("\t*                                                              *\n");
    printf("\t          ——————欢迎%s进入公司信息管理系统——————                  \n",name);
    printf("\t*                                                              *\n");
    printf("\t****************************************************************\n");
    printf("\t                                                                \n");
    printf("\t                       相关操作选项                           \n");
    printf("\t                                                                \n");
    printf("\t****************************************************************\n");
    printf("\t*                     0.安全退出系统                           *\n");
    printf("\t*                     1.查看个人信息                           *\n");
    printf("\t*                     2.修改个人信息                           *\n");
    printf("\t****************************************************************\n");
    printf("请输入功能编号1~7, 0 表示退出:");
	iChoice=inputdigit02(ch);
    return iChoice;
}

//主界面
int  salespersonUI(char name[30])
{
    int iChoice = 0;
    char ch;
    system("clear");     
    printf("\n\t****************************************************************\n");
    printf("\t*                                                              *\n");
    printf("\t          ——————欢迎%s进入公司信息管理系统——————                  \n",name);
    printf("\t*                                                              *\n");
    printf("\t****************************************************************\n");
    printf("\t                                                                \n");
    printf("\t                       相关操作选项                           \n");
    printf("\t                                                                \n");
    printf("\t****************************************************************\n");
    printf("\t*                     0.安全退出系统                           *\n");
    printf("\t*                     1.查看个人信息                           *\n");
    printf("\t*                     2.修改个人信息                           *\n");
    printf("\t****************************************************************\n");
    printf("请输入功能编号0~2:");
	iChoice=inputdigit02(ch);
    return iChoice;
}

/********************************
功能:登录时按对应的职称进行登录
使用:在登录函数中调用
参数:无
********************************/
int loginmenu()
{
	int choice;
	char ch;
	printf("\t\033[47;31m ***************欢迎进入公司管理系统**************\033[0m\n");
	printf("\t\033[47;31m **                                             **\033[0m\n"); 
	printf("\t\033[47;31m **             1.boss登录                      **\033[0m\n");
	printf("\t\033[47;31m **                                             **\033[0m\n");
	printf("\t\033[47;31m **             2.经理登录                      **\033[0m\n");
	printf("\t\033[47;31m **                                             **\033[0m\n");
	printf("\t\033[47;31m **             3.销售经理登录                  **\033[0m\n");
	printf("\t\033[47;31m **                                             **\033[0m\n");
	printf("\t\033[47;31m **             4.技术人员登录                  **\033[0m\n");
	printf("\t\033[47;31m **                                             **\033[0m\n");
	printf("\t\033[47;31m **             5.销售人员登录                  **\033[0m\n");
	printf("\t\033[47;31m **                                             **\033[0m\n");
	printf("\t\033[47;31m **             0.退出                          **\033[0m\n");
	printf("\t\033[46;31m *************************************************\033[0m\n");
	printf("\033[;31m 请输入操作的编号:\033[0m\n");
	choice=inputdigit05(ch);// 等待键盘输入是一个数字0~5否则就一直等待用户输入
	return choice;
}

/***********************************
功能:登录匹配各类人员信息的函数
使用:在main函数中调用
传入参数:无
************************************/
int LoginUI()
{
	STNODE *head=NULL;
	head=readfiletolist("personinfo.txt");//从文件中读取登录人员的信息
	int choice=1;
	int choice1;
	choice1=loginmenu();//主菜单中选择登录的职称类型返回的值
	if(choice1==1)//boss登录
	{
		bosslogin();//boss登录验证子函数
	}
	else if(choice1==2)//经理登录验证
	{
		managerlogin(head);
	}
	else if(choice1==3)//销售经理登录验证
	{
		salesmanagerlogin(head);
	}
	else if(choice1==4)//技术人员登录验证
	{
		skillpersonlogin(head);
	}
	else if(choice1==5)//销售人言登录验证
	{
		salespersonlogin(head);
	}
	else if(choice1==0)
	{
		DestroyLinklist(head);//销毁此链表并且退出
	}
	DestroyLinklist(head);//销毁此链表并且退出	
}








































